app/controllers/api/v1/operations_imported_stores_controller.rb

SELECT "cnabs".* FROM "cnabs" WHERE "cnabs"."store" = $1  [["store", "Bar do João"]]
---
  def index
    @stores = Cnab.where("store ilike '%#{params[:store]}%'")
    account_balance_totalizer = @stores.map{|store| store.movement_value}.sum