app/controllers/importer_data_cnab_controller.rb

SELECT "cnabs".* FROM "cnabs" WHERE "cnabs"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "importer_data_cnabs".* FROM "importer_data_cnabs" WHERE "importer_data_cnabs"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def index
    @importer_data_cnab = ImporterDataCnab.find(18)

INSERT INTO "importer_data_cnabs" ("document", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["document", nil], ["created_at", "2023-05-18 18:00:04.406274"], ["updated_at", "2023-05-18 18:00:04.406274"]]
INSERT INTO "cnabs" ("name", "cod1", "cod2", "importer_data_cnab_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @importer_data_cnab = ImporterDataCnab.new(importer_data_cnab_params)
    if @importer_data_cnab.save