app/controllers/concerns/importer_data_cnab_controller_concern.rb

INSERT INTO "cnabs" ("shop_owner", "store", "transaction_type", "date_occurrence", "movement_value", "cpf_beneficiary", "card_transaction", "hour_transaction", "importer_data_cnab_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def insert_data_cnab(importer_data_cnab)
      if importer_data_cnab.present?
        file = importer_data_cnab.document
        path = ActiveStorage::Blob.service.path_for(file.key)

        arr_file = []
        File.readlines(path).each do |line|
          arr_line = line.split(" ")
          data_customer = verify_name(arr_line[1])

          shop_owner = get_shop_owner(arr_line[1], arr_line)
          store = get_store(data_customer[1], arr_line[2..])
          transaction_type = arr_line[0][0].to_i
          date_occurrence = get_date_occurrence(arr_line[0])
          movement_value = get_movement_value(arr_line[0][8..17])
          cpf_beneficiary = arr_line[0][18..28]
          card_transaction = arr_line[0][29..40]
          hour_transaction = get_hour_transaction(arr_line[0])

          Cnab.create(shop_owner: shop_owner, store: store.strip, transaction_type: transaction_type,
            date_occurrence: date_occurrence, movement_value: movement_value,
            cpf_beneficiary: cpf_beneficiary, card_transaction: card_transaction,
            hour_transaction: hour_transaction, importer_data_cnab_id: importer_data_cnab.id
          )